huytq1996/khoa-luan-tot-nghiep/UART stm32/MDK-ARM/LCD.h
#ifndef LCD_H
#define LCD_H
#include "stm32f4xx_hal.h"
#define LCD_ADD 0x3F<<1
/*Note: Comment which not use */
// commands
#define LCD_CLEARDISPLAY 0x01
#define LCD_RETURNHOME 0x02
#define LCD_ENTRYMODESET 0x04
#define LCD_DISPLAYCONTROL 0x08
#define LCD_CURSORSHIFT 0x10
#define LCD_FUNCTIONSET 0x20
#define LCD_SETCGRAMADDR 0x40
#define LCD_SETDDRAMADDR 0x80

// flags for display entry mode
#define LCD_ENTRYRIGHT 0x00
#define LCD_ENTRYLEFT 0x02
#define LCD_ENTRYSHIFTINCREMENT 0x01
#define LCD_ENTRYSHIFTDECREMENT 0x00

// flags for display on/off control
#define LCD_DISPLAYON 0x04
#define LCD_DISPLAYOFF 0x00
#define LCD_CURSORON 0x02
#define LCD_CURSOROFF 0x00
#define LCD_BLINKON 0x01
#define LCD_BLINKOFF 0x00

// flags for display/cursor shift
#define LCD_DISPLAYMOVE 0x08
#define LCD_CURSORMOVE 0x00
#define LCD_MOVERIGHT 0x04
#define LCD_MOVELEFT 0x00

// flags for function set
#define LCD_8BITMODE 0x10
#define LCD_4BITMODE 0x00
#define LCD_2LINE 0x08
#define LCD_1LINE 0x00
#define LCD_5x10DOTS 0x04
#define LCD_5x8DOTS 0x00

// flags for backlight control
#define LCD_BACKLIGHT 0x08
#define LCD_NOBACKLIGHT 0x00

#define En 0x04  // Enable bit
#define Rw 0x02  // Read/Write bit
#define Rs 0x01  // Register select bit

void lcd_init(uint8_t lines , uint8_t cols);
void lcd_expanderWrite(uint8_t _data);
void lcd_pulseEnable(uint8_t _data);
void lcd_write4bits(uint8_t value);
void lcd_send(uint8_t value, uint8_t mode);
void lcd_write(char value);
void lcd_write_string(char *value);
void lcd_command(uint8_t value);
void lcd_display(void);
void lcd_clear(void);
void lcd_home(void);
void lcd_setCursor(uint8_t row, uint8_t col);
int colorNumber(void);
#endif
